# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растет на
# круглой грядке, причем кусты высажены только по окружности. Таким образом, у
# каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них
# выросло различное число ягод – на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым
# кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может
# собрать за один заход собирающий модуль, находясь перед некоторым кустом
# заданной во входном файле грядки.

# 4 -> 1 2 3 4
# 9

from random import randrange

n = int(input('Введите количество кустов на грядке: '))

array = []
for i in range(0, n):
    array.append(randrange(10))

print(f"{n} -> {array}")

def sum_berries(array):
    sum = 0
    i = 0
    if (len(array) <= 3):
        while (i < len(array)):
            sum += array[i]
            i += 1
        return sum
    else:
        i = 0
        sum = array[i] + array[i+1] + array[i+2]
        max = 0
        while (i < n - 3):
            for item in range(i+1, i+4):
                max += array[item]
            if (max > sum): sum = max
            i += 1
            max = 0
        return sum

print(sum_berries(array))